app/controllers/posts_controller.rb

  def create
  	@post = Post.new(post_params)
  	if @post.save
---
INSERT INTO "posts" ("title", "body", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)